// Задача 1: Напишите программу, которая принимает
//на вход число и выдаёт количество цифр в числе.
// 456 -> 3
// 78 -> 2
//89126 -> 5 


void Lenght (int a)
{
    string num = a.ToString();
    Console.WriteLine (num.Length);
}
Console.WriteLine(" ");
Lenght(15216);


