// 1. Напишите программу, которая принимает на вход
//координаты точки (X и Y), причём X ≠ 0 или Y ≠ 0 и
//выдаёт номер четверти плоскости, в которой находится
//эта точка.




Console.WriteLine("Hello, World!");
